@Component
public class Consumer {

    // Аннотация, которая позволяет прослушивать очередь с указанным именем
    // Когда в очереди появляется сообщение, вызывается отмеченный метод
    @RabbitListener(queues = "queue")
    public void processQueue(String message) {
        // В простейшем случае просто выводим полученное сообщение
        // В общем случае этот сервис может делать с сообщением все, что угодно.
        // Например, можно использовать данные пользователя из сообщения
        // и создавать аккаунт или отправлять пользователю письмо или смс
        // Получатель никак не зависит от отправителя, отправитель сообщения даже не знает,
        // кто и как будет использовать полученное сообщение
        System.out.printl(message);
    }
}
